FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC1788/LPC1788_IAP.c
    T_Flash_NXP_LPC1788_Workspace *p = (T_Flash_NXP_LPC1788_Workspace *)aW;

    // Then create a semaphore to limit the number of accessors
    error = UEZSemaphoreCreateBinary(&p->iSem);

    p->iNumOpen = 0;
    
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1788_Open
 *---------------------------------------------------------------------------*
 * Description:
 *      Open the flash device. Initialize the flash
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aAddress            -- Base address into device to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1788_Open(void *aWorkspace)
{
    T_Flash_NXP_LPC1788_Workspace *p =
        (T_Flash_NXP_LPC1788_Workspace *)aWorkspace;
    /* Declare erase operation result container variable */
    p->iNumOpen++;
    if (p->iNumOpen == 1) {
        // If the first time, assume we were in some programming mode
        // and need to reset and Re-enable access to the Flash Data area
        ILPC1788_IAP_Start(ETrue);
    }

    return ((T_uezError)UEZ_ERROR_NONE);
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1788_Close
 *---------------------------------------------------------------------------*
 * Description:
 *      Close the flash device.  For the NXP LPC1788, the flash area access
 *      needs to be closed using IExitProgramMode.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aAddress            -- Base address into device to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1788_Close(void *aWorkspace)
{
    T_Flash_NXP_LPC1788_Workspace *p =
        (T_Flash_NXP_LPC1788_Workspace *)aWorkspace;
    if (p->iNumOpen) {
        p->iNumOpen--;
        if (p->iNumOpen == 0) {
            ILPC1788_IAP_End();
        }
        return UEZ_ERROR_NONE;
    } else {
        return UEZ_ERROR_NOT_OPEN;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1788_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read bytes out of the Flash.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte Offset address into flash to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1788_Read(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC1788_Workspace *p =
        (T_Flash_NXP_LPC1788_Workspace *)aWorkspace;
    T_uezError error = UEZ_ERROR_NONE;

    // Make sure its not in a programming mode.
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    ILPC1788_IAP_End();

    // The memory is now accessible, copy the data over
    // Simple copy with check to see if the requested area is within the data flash
    if ((aOffset + (TUInt32)aNumBytes) <= (512 * 1024)) {
        memcpy(aBuffer, (void *)(aOffset), aNumBytes);
    } else {
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1788_Write
 *---------------------------------------------------------------------------*
 * Description:
 *      Write bytes into the Flash
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte Offset into flash to write
 *      TUInt8 *aBuffer             -- Pointer to buffer of data
 *      TUInt32 aNumBytes           -- Number of bytes to write
 * Outputs:
 *      T_uezError                  -- Error code.  Returns
 *                                      UEZ_ERROR_BAD_ALIGNMENT if offset
 *                                      or number of bytes
 *                                      is not on word boundary.
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1788_Write(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC1788_Workspace *p =
        (T_Flash_NXP_LPC1788_Workspace *)aWorkspace;
    T_uezError error = UEZ_ERROR_NONE;

    // Let's do it
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Write the given block of data to the given address
    // Cut up the write command into blocks of BLOCK_SIZE size.
    // Keep doing this until all the bytes are processed
    while (aNumBytes) {
        error = IIAPWrite(&aOffset, &aBuffer, &aNumBytes);
        if (error != UEZ_ERROR_NONE)
            break;
    }

    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1788_BlockErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase one or more blocks in the given location
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte offset into the flash memory
 *      TUInt32 aNumBytes           -- Number of bytes
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1788_BlockErase(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC1788_Workspace *p =
        (T_Flash_NXP_LPC1788_Workspace *)aWorkspace;
    TInt32 blockNum;
    TInt32 blockEnd;

